cfg/Catalogs/БанковскиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>БанковскиеСчета</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Comment>(Общ) Номер расчетного счета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>34</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанкДляРасчетов</Name>
					<Comment>(Регл) Банк, в случае непрямых расчетов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстКорреспондента</Name>
					<Comment>(Регл) Текст "Плательщик\Получатель" в платежных документах</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстНазначения</Name>
					<Comment>(Общ) Текст назначения платежа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчета</Name>
					<Comment>(Общ) Расчетный, депозитный, ссудный, иной</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДенежныхСредств</Name>
					<Comment>(Общ) Валюта, в которой хранятся денежные средства</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИДатаРазрешения</Name>
					<Comment>(Регл) Номер и дата разрешения открытия счета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Comment>(Общ) Дата открытия счета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Comment>(Общ) Дата закрытия счета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБезКопеек</Name>
					<Comment>(Общ) Указывать сумму без копеек, если она в целых денежных единицах</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКонтрагентДляОграниченияПравДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОрганизацияДляОграниченияПравДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцПрописью</Name>
					<Comment>(Общ) Указывать в дате документа месяц прописью</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетаУстаревший</Name>
					<Comment>(Общ) Номер расчетного счета в устаревшем формате</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfg/Catalogs/БанковскиеСчета/Forms/ФормаЭлемента/Ext/Form/Module.bsl
Перем мВалютаРегламентированногоУчета;

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Заполняет реквизит "ТекстКорреспондента"
 //
 // Параметры:
 //  Нет.
 //
Процедура ЗаполнитьТекстКорреспондента()

	мВладелец     = ЭтотОбъект.Владелец;

	Если НЕ ЗначениеЗаполнено(мВладелец) Тогда
		Возврат;
	КонецЕсли;

	ТипВладельца = ТипЗнч(мВладелец);
	Если ТипВладельца = Тип("СправочникСсылка.Организации") Тогда
		СтрКорреспондента = СокрЛП(мВладелец.НаименованиеПолное);
	ИначеЕсли ТипВладельца = Тип("СправочникСсылка.Контрагенты") Тогда
		СтрКорреспондента = СокрЛП(мВладелец.НаименованиеПолное);
	КонецЕсли;	

	Если НЕ БанкДляРасчетов.Пустая() Тогда
		СтрКорреспондента = СтрКорреспондента + " р/с " + НомерСчета
			+ " в " + Банк + " " + Банк.Город;
	КонецЕсли;	

	ТекстКорреспондента = СтрКорреспондента;	

КонецПроцедуры // ЗаполнитьТекстКорреспондента()

// Управляет видимостью некоторых элементов формы
//
// Параметры:
//  Нет.
//
Процедура УстановитьВидимость()

	Если (НЕ ЗначениеЗаполнено(ВалютаДенежныхСредств))
	 ИЛИ (ВалютаДенежныхСредств = мВалютаРегламентированногоУчета) Тогда
		ЭлементыФормы.НомерИДатаРазрешения.Видимость = Ложь;
		ЭлементыФормы.НадписьНомерИДатаРазрешения.Видимость = Ложь;

	Иначе
		ЭлементыФормы.НомерИДатаРазрешения.Видимость = Истина;
		ЭлементыФормы.НадписьНомерИДатаРазрешения.Видимость = Истина;

	КонецЕсли;

КонецПроцедуры // УстановитьВидимость()

Процедура ДействияФормыРедактироватьКод(Кнопка)
	МеханизмНумерацииОбъектов.ИзменениеВозможностиРедактированияНомера(ЭтотОбъект.Метаданные(), ЭтаФорма, ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.Код);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()

	Если ЭтоНовый() Тогда
 		Если НЕ ЗначениеЗаполнено(ВидСчета) Тогда
 			ВидСчета = ЭлементыФормы.ВидСчета.СписокВыбора[0];
 		КонецЕсли;
		ЗаполнитьТекстКорреспондента();
		Если НЕ ЗначениеЗаполнено(ВалютаДенежныхСредств) Тогда
			ВалютаДенежныхСредств = мВалютаРегламентированногоУчета;
		КонецЕсли;
		
	КонецЕсли;
	
	МеханизмНумерацииОбъектов.ДобавитьВМенюДействияКнопкуРедактированияКода(ЭлементыФормы.ДействияФормы.Кнопки.Подменю);
	МеханизмНумерацииОбъектов.УстановитьДоступностьПоляВводаНомера(Метаданные(), ЭтаФорма, ЭлементыФормы.ДействияФормы.Кнопки.Подменю,ЭлементыФормы.Код);
	
 	УстановитьВидимость();
 	ЗакрыватьПриВыборе = Ложь;

КонецПроцедуры

// Обработчик события ПослеЗаписи формы.
//
Процедура ПослеЗаписи()
	
	Если ЭтаФорма.ВладелецФормы <> Неопределено Тогда
	
		ОповеститьОВыборе(Ссылка);
	
	КонецЕсли; 
	
	МеханизмНумерацииОбъектов.ОбновитьПодсказкуКодНомерОбъекта(ЭтотОбъект.Метаданные(), ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.Код);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ДЕЙСТВИЙ КОМАНДНЫХ ПАНЕЛЕЙ ЭЛЕМЕНТОВ

 // Обработчик события "ПриИзменении" реквизита "БанкДляРасчетов"
 //
Процедура БанкДляРасчетовПриИзменении(Элемент)
	ЗаполнитьТекстКорреспондента();
КонецПроцедуры

 // Обработчик события "ПриИзменении" реквизита "НомерСчета"
 //
Процедура НомерСчетаПриИзменении(Элемент)
	НомерСчета = СокрЛП(НомерСчета);

	Если НЕ ЭтоНовый() 
		И НЕ ЗначениеЗаполнено(Ссылка.НомерСчетаУстаревший)
		И НомерСчета <> Ссылка.НомерСчета
		И УправлениеДенежнымиСредствами.НомерБанковскогоСчетаСоответствуетСтандартуIBAN(НомерСчета)
		И НЕ УправлениеДенежнымиСредствами.НомерБанковскогоСчетаСоответствуетСтандартуIBAN(Ссылка.НомерСчета) Тогда
		
		НомерСчетаУстаревший = Ссылка.НомерСчета;
		
	КонецЕсли;
	
	БанкПоСчету = УправлениеДенежнымиСредствами.ПолучитьБанкПоНомеруСчетаIBAN(НомерСчета);
	Если ЗначениеЗаполнено(БанкПоСчету) Тогда
		Банк = БанкПоСчету;
	КонецЕсли;
	ЗаполнитьТекстКорреспондента();
КонецПроцедуры

 // Обработчик события "ПриИзменении" реквизита "Банк"
 //
Процедура БанкПриИзменении(Элемент)
	ЗаполнитьТекстКорреспондента();
КонецПроцедуры

 // Обработчик события "ПриИзменении" реквизита "ВалютаДенежныхСредств"
 //
Процедура ВалютаДенежныхСредствПриИзменении(Элемент)

	УстановитьВидимость()

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ТЕЛО МОДУЛЯ

СписокВидСчета = ЭлементыФормы.ВидСчета.СписокВыбора;
СписокВидСчета.Добавить(НСтр("ru='Текущий';uk='Поточний'"));
СписокВидСчета.Добавить(НСтр("ru='Депозитный';uk='Депозитний'"));
СписокВидСчета.Добавить(НСтр("ru='Ссудный';uk='Позичковий'"));
СписокВидСчета.Добавить(НСтр("ru='Иной';uk='Інший'"));

мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
